

# ===============================================================
# ===============================================================

# название файла сессии с которого будут покупаться подарки (с звездами) (из папки sessions)
BUYER_SESSION: str = "buyer_enbanned"

# названия файлов сессий, которые будут отслеживать на новые подарки (из папки sessions)
HUNTER_SESSIONS: list[str] = [
    "hunter_kentofarikf_1",
    "hunter_akalns_2", 
    "hunter_kenyssa_3",
    "hunter_goolenok_7"
]

# ===============================================================
# ===============================================================

# название файла сессии телеграм бота в который будут приходить уведомления (из папки sessions)
BOT_SESSION: str = "notification_bot"

# ID вашего чата или же вашей лички куда бот будет отправлять уведомления. Можно получить здесь - @getmyid_bot
LOG_CHAT_ID: int = 891879512

# ===============================================================
# ===============================================================

# юзернейм канала/пользователя на который будут покупаться подарки
TARGET_USERNAME: str = "channel_giftsssx"

# ===============================================================
# ===============================================================


# Критерии покупки подарков

# Формат: [(min_supply, max_supply, min_price, max_price, quantity), ...]

# supply - общее количество подарков
# price - цена в Stars
# quantity - сколько подарков купить при совпадении критериев

# PURCHASE_CRITERIA: list[tuple[int, int, int, int, int]] = [
#
#     # (min_supply, max_supply, min_price, max_price, quantity)
#     (1000, 10000, 10, 100, 5),      # Если supply 1000-10000 и цена 10-100 stars, купить 5 штук
#     (10000, 50000, 10, 500, 3),     # Если supply 10000-50000 и цена 10-500 stars, купить 3 штуки
#     (50000, 100000, 10, 1000, 2),   # Если supply 50000-100000 и цена 10-1000 stars, купить 2 штуки
#     (100000, 500000, 10, 2000, 1),  # Если supply 100000-500000 и цена 10-2000 stars, купить 1 штуку
#
# ]

PURCHASE_CRITERIA: list[tuple[int, int, int, int, int]] = [
    # (min_supply, max_supply, min_price, max_price, quantity)
    (1, 30001, 1, 1000000, 9999),  # Supply 1-29999, цена 1-1000000, купить 9999 штук
]

# ===============================================================
# ===============================================================

# Базовый интервал между проверками для каждого охотника (секунды)
BASE_CHECK_INTERVAL: float = 7

# Минимальный интервал между проверками (секунды)
MIN_CHECK_INTERVAL: float = 2.0

# Максимальный интервал между проверками (секунды)
MAX_CHECK_INTERVAL: float = 15

# Адаптивная настройка интервалов
ADAPTIVE_INTERVALS: bool = True  # Автоматическая подстройка интервалов

# Добавить случайную задержку (0-X секунд) для имитации человека
RANDOM_DELAY_MAX: float = 1

MIN_HUNTERS_COUNT: int = 1  # минимальное количество охотников
MIN_STARS_BALANCE: int = 1  # минимальный баланс Stars для начала работы


# ===============================================================
# ===============================================================


PURCHASE_NON_LIMITED_GIFTS: bool = False  # Покупать не-лимитированные подарки. Не менять

DEBUG_MODE: bool = False
SESSIONS_DIR: str = "sessions"
