# ===============================================================
# ===============================================================

# названия файлов сессий с которых будут покупаться подарки (с звездами) (из папки sessions)
# эти аккаунты будут использоваться для покупки подарков
BUYER_SESSIONS: list[str] = [
    "buyer_enbanned",
    "hunter_akalns_2",
    "hunter_goolenok_7", 
    "hunter_kentofarikf_1",
    "hunter_kenyssa_3"
    # добавьте столько аккаунтов-покупателей, сколько нужно
]

# использовать ли аккаунты-покупатели также для отслеживания новых подарков
# если True - покупатели будут также проверять новые подарки
# если False - покупатели будут только покупать, а проверять будут только охотники
USE_BUYERS_AS_HUNTERS: bool = True

# названия файлов сессий, которые будут ТОЛЬКО отслеживать новые подарки (из папки sessions)
# если USE_BUYERS_AS_HUNTERS = True, то можете оставить пустым список
# если USE_BUYERS_AS_HUNTERS = False, то обязательно добавьте хотя бы одного охотника
HUNTER_SESSIONS: list[str] = [
    # "hunter_akalns_2",
    # "hunter_goolenok_7", 
    # "hunter_kentofarikf_1",
    # "hunter_kenyssa_3"
]

# ===============================================================
# ===============================================================

# название файла сессии телеграм бота в который будут приходить уведомления (из папки sessions)
BOT_SESSION: str = "notification_bot"

# ID вашего чата или же вашей лички куда бот будет отправлять уведомления. Можно получить здесь - @getmyid_bot
LOG_CHAT_ID: int = 891879512

# ===============================================================
# ===============================================================

# юзернеймы каналов/пользователей на которые будут покупаться подарки
TARGET_USERNAMES: list[str] = [
    'vdbddid',
    'ZRhMGEy',
    'HxdBo5MkhjZDM6',
    'BIz1oeMgao1Zjli',
    'NnqVyI6kPdU0MjZi',
    'BUi6o9YLs2OTYy',
    'FZybV3R28JoyMmMy',
    'FFnctRi_LgyYjUy',
    'xhSEpzx8xNzdi',
    'lg85MM4_VpiN2Fi',
    'channel_giftsssx',
    'Vladyslav_KLIK',
    'enbanned'
]

# ===============================================================
# ===============================================================

# Критерии покупки подарков
PURCHASE_CRITERIA: list[tuple[int, int, int, int, int]] = [
    # (min_supply, max_supply, min_price, max_price, quantity)
    (1, 30001, 1, 1000000, 9999),  # Supply 1-30001, цена 1-1000000, купить 9999 штук
]

# ===============================================================
# ===============================================================

# Задержка между покупаками подарков одним аккаунтом (в секундах)
PURCHASE_DELAY: float = 0.1

# Покупать любой доступный подарок если не удалось купить подарки по критериям
# False - покупать только подарки которые подходят под критерии
# True - если не удалось купить по критериям, купить любой доступный подарок на который хватит баланса
FALLBACK_PURCHASE: bool = False

# ===============================================================
# ===============================================================

# Интервал между проверками для каждого охотника (секунды)
CHECK_INTERVAL: float = 7

# Добавить случайную задержку (0-X секунд) для имитации человека
RANDOM_DELAY_MAX: float = 1

# ===============================================================
# ===============================================================

MIN_STARS_BALANCE: int = 1  # минимальный баланс Stars для начала работы (общий для всех покупателей)
PURCHASE_NON_LIMITED_GIFTS: bool = False  # Покупать не-лимитированные подарки. Не менять